mariopartyrd/marioparty4/src/REL/m408Dll/object.c
void fn_1_155E0(s16 arg0, s16 arg1)
{
    HU3DMODEL *temp_r31;
    HU3DPARTICLE *temp_r30;
    temp_r31 = &Hu3DData[arg0];
    temp_r30 = temp_r31->hookData;
    temp_r30->dataCnt = arg1;
}

void fn_1_15618(s16 arg0, float arg1, float arg2, float arg3)
{
    HU3DPARTICLE *temp_r31;
    HU3DMODEL *temp_r30;
    temp_r30 = &Hu3DData[arg0];
    temp_r31 = temp_r30->hookData;
    temp_r31->pos.x = arg1;
    temp_r31->pos.y = arg2;
    temp_r31->pos.z = arg3;
}

void fn_1_15658(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix)
{
    float temp_f31;
    float temp_f30;
    HU3DPARTICLEDATA *temp_r31;
    u32 temp_r29;
    s32 temp_r28;
    s16 temp_r27;
    GXColor *temp_r26;
    if (particle->count == 0) {
        temp_f31 = 90;
        particle->emitCnt = 0;
        particle->unk_10.y = 3;
        temp_r31 = particle->data;
        for (temp_r28 = 0; temp_r28 < particle->maxCnt; temp_r28++, temp_r31++) {
            temp_r31->scale = 0;
            temp_r31->color.a = 0;
        }
    }
    if (particle->dataCnt) {
        particle->emitCnt--;
        if (particle->emitCnt <= 0.0f) {
            particle->emitCnt = 2;
            temp_r27 = 4;
            temp_r31 = particle->data;
            for (temp_r28 = 0; temp_r28 < particle->maxCnt; temp_r28++, temp_r31++) {
                if (temp_r31->scale != 0) {
                    continue;
                }
                temp_r31->pos.x = particle->pos.x;
                temp_r31->pos.y = particle->pos.y;
                temp_r31->pos.z = particle->pos.z;
                temp_f30 = frandmod(360);
                temp_r29 = frandmod(12);
                temp_r29 += 4.0f;
                temp_r31->pos.x = temp_r31->pos.x + (temp_r29 * sind(temp_f30));
                temp_r31->pos.z = temp_r31->pos.z + (temp_r29 * cosd(temp_f30));
                temp_r31->speedDecay = 0;
                temp_r31->colorIdx = particle->unk_10.y;
                temp_r29 = 1;
                if (temp_r29 == 1) {
                    temp_r31->accel.x = 0.97643f;
                }
                else {
                    temp_r31->accel.x = 0.96666664f;
                }
                temp_r31->time = 60;
                temp_r31->scale = 8;
                temp_r29 = frand() & 0x1;
                temp_r26 = &lbl_1_data_4F4[temp_r29];
                temp_r31->color.r = temp_r26->r;
                temp_r31->color.g = temp_r26->g;
                temp_r31->color.b = temp_r26->b;
                temp_r31->color.a = 0;
                temp_r31->parManId = temp_r29;
                temp_r27--;
                if (temp_r27 == 0) {
                    break;
                }
            }
        }
    }
    temp_r27 = 0;
    temp_r31 = particle->data;
    for (temp_r28 = 0; temp_r28 < particle->maxCnt; temp_r28++, temp_r31++) {
        if (temp_r31->scale == 0) {
            continue;
        }
        temp_r27++;
        temp_r31->pos.y -= 4.0f;
        temp_f31 = 1.0 + cosd(temp_r31->speedDecay);
        temp_f31 *= 0.5f;
        temp_r31->color.a = temp_f31 * 255;
        temp_r31->speedDecay += temp_r31->colorIdx;
        temp_r31->zRot = temp_r31->speedDecay;
        temp_r31->scale *= temp_r31->accel.x;
        temp_r31->parManId ^= 0x3;
        if (temp_r31->parManId & 0x1) {
            temp_r31->color.b = 0;
            temp_r31->color.g = 200;
        }
        else {
            temp_r31->color.b = 200;
            temp_r31->color.g = 200;
        }
        if (temp_r31->parManId & 0x2) {
            temp_r29 = temp_r31->color.a + 64;
            if (temp_r29 > 255) {
                temp_r29 -= 128;
            }
            temp_r31->color.a = temp_r29;
        }
        temp_r31->time--;
        if (temp_r31->time <= 0) {
            temp_r31->scale = 0;
        }
    }
    DCStoreRange(particle->data, particle->maxCnt * sizeof(HU3DPARTICLEDATA));
    if (particle->dataCnt == 0 && temp_r27 == 0) {
        model->attr |= 0x1;
    }
}

void fn_1_15B50(s16 arg0)
{
    HU3DPARTICLE *temp_r31;
    HU3DPARTICLEDATA *temp_r30;
    s32 temp_r29;
    HU3DMODEL *temp_r28 = &Hu3DData[arg0];
    temp_r31 = temp_r28->hookData;
    temp_r31->count = 0;
    temp_r30 = temp_r31->data;
    for (temp_r29 = 0; temp_r29 < temp_r31->maxCnt; temp_r29++, temp_r30++) {
        temp_r30->scale = 0;
    }
}

void fn_1_15CA4(OMOBJ *object);
void fn_1_15D64(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix);

void fn_1_15BCC(OMOBJ *object)
{
    s16 temp_r30;
    s32 temp_r29;
    omSetStatBit(object, 0x100);
    for (temp_r29 = 0; temp_r29 < 4; temp_r29++) {
        temp_r30 = Hu3DParticleCreate(HuSprAnimReadFile(DATA_MAKE_NUM(DATADIR_M408, 0x19)), 9);
        object->mdlId[temp_r29] = temp_r30;
        Hu3DModelAttrSet(temp_r30, HU3D_ATTR_DISPOFF);
        Hu3DModelLayerSet(temp_r30, 7);
        Hu3DParticleColSet(temp_r30, 255, 255, 255);
        Hu3DParticleHookSet(temp_r30, fn_1_15D64);
    }
    object->work[0] = -1;
    object->objFunc = fn_1_15CA4;
}

void fn_1_15CA4(OMOBJ *object)
{
    s32 temp_r31;
    s16 temp_r29;
    HU3DMODEL *temp_r28;
    HU3DPARTICLE *temp_r27;
    temp_r31 = object->work[0];
    if (temp_r31 <= -1) {
        return;
    }
    object->work[0] = -1;
    temp_r29 = object->mdlId[temp_r31];
    temp_r28 = &Hu3DData[temp_r29];
    temp_r27 = temp_r28->hookData;
    Hu3DModelAttrReset(temp_r29, HU3D_ATTR_DISPOFF);
    Hu3DModelPosSet(temp_r29, lbl_1_bss_D6C[temp_r31].x, lbl_1_bss_D6C[temp_r31].y, lbl_1_bss_D6C[temp_r31].z);
    temp_r27->count = 0;
}

void fn_1_15D64(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix)
{
    float temp_f31;
    float temp_f30;
    float temp_f29;
    float temp_f28;
    HU3DPARTICLEDATA *temp_r31;
    s32 temp_r29;
    u32 temp_r28;
    s16 temp_r27;
    s16 temp_r26;
    if (particle->count == 0) {
        temp_f31 = 72;
        particle->dataCnt = 1;
        particle->emitCnt = 0;
        particle->unk_10.y = 22.5f;
        temp_r31 = particle->data;
        for (temp_r29 = 0; temp_r29 < particle->maxCnt; temp_r29++, temp_r31++) {
            temp_r31->scale = 0;
            temp_r31->color.a = 0;
        }
    }
    if (particle->dataCnt) {
        particle->dataCnt = 0;
        particle->emitCnt--;
        if (particle->emitCnt <= 0.0f) {
            particle->emitCnt = 30;
            temp_r31 = particle->data;
            temp_r26 = -1;
            temp_r27 = 0;
            for (temp_r29 = 0; temp_r29 < particle->maxCnt; temp_r29++, temp_r31++) {
                if (temp_r31->scale != 0) {
                    continue;
                }
                if (temp_r27 <= 0) {
                    temp_r26++;
                    if (temp_r26 >= 3) {
                        break;
                    }
                    temp_f30 = lbl_1_data_514[temp_r26];
                    temp_f28 = lbl_1_data_508[temp_r26];
                    temp_f29 = lbl_1_data_520[temp_r26];
                    temp_r27 = lbl_1_data_504[temp_r26];
                }
                temp_r27--;
                temp_r31->pos.x = temp_r31->pos.y = temp_r31->pos.z = 0;
                if (90.0f == temp_f29) {
                    temp_r31->vel.z = 5;
                    temp_r31->vel.x = temp_r31->vel.y = 0;
                }
                else {
                    temp_f31 = 5 * cosd(temp_f29);
                    temp_r31->vel.z = 5.0 * sind(temp_f29);
                    temp_r31->vel.x = temp_f31 * sind(temp_f30);
                    temp_r31->vel.y = temp_f31 * cosd(temp_f30);
                }
                temp_r31->speedDecay = 0;
                temp_r31->colorIdx = particle->unk_10.y;
                temp_r28 = 1;
                temp_r31->time = 8;
                temp_r31->scale = 10;
                temp_r31->accel.x = 1.125f;
                temp_r28 = frand() & 0x1;
                temp_r31->parManId = temp_r28;
                temp_r31->color.r = 255;
                temp_r31->color.g = 255;
                temp_r31->color.b = 255;
                temp_r31->color.a = 0;
                if (temp_r28) {
                    temp_r31->color.b = 0;
                    temp_r31->color.g = 0;
                }
                temp_f30 += temp_f28;
            }
        }
    }
    temp_r27 = 0;
    temp_r31 = particle->data;
    for (temp_r29 = 0; temp_r29 < particle->maxCnt; temp_r29++, temp_r31++) {
        if (temp_r31->scale == 0) {
            continue;
        }
        temp_r27++;
        VECAdd(&temp_r31->vel, &temp_r31->pos, &temp_r31->pos);
        temp_f31 = 1.0 + cosd(temp_r31->speedDecay);
        temp_f31 *= 0.45f;
        temp_r31->color.a = temp_f31 * 255;
        temp_r31->speedDecay += temp_r31->colorIdx;
        temp_r31->scale -= temp_r31->accel.x;
        temp_r31->parManId ^= 0x3;
        if (temp_r31->parManId & 0x1) {
            temp_r31->color.b = 0;
            temp_r31->color.g = 100;
        }
        else {
            temp_r31->color.b = 0;
            temp_r31->color.g = 200;
        }
        if (temp_r31->parManId & 0x2) {
            temp_r28 = temp_r31->color.a + 64;
            if (temp_r28 > 255) {
                temp_r28 -= 128;
            }
            temp_r31->color.a = temp_r28;
        }
        temp_r31->time--;
        if (temp_r31->time <= 0) {
            temp_r31->scale = 0;
        }
    }
    DCStoreRange(particle->data, particle->maxCnt * sizeof(HU3DPARTICLEDATA));
    if (particle->dataCnt == 0 && temp_r27 == 0) {
        model->attr |= 0x1;
    }
}

s32 fn_1_162CC(Vec *arg0, Vec *arg1)
{
    Vec spC;
    s32 temp_r31;
    float temp_f31;
    float temp_f30;
    temp_f30 = 1000;
    if (!lbl_1_bss_168) {
        return 0;
    }
    for (temp_r31 = 0; temp_r31 < lbl_1_bss_168; temp_r31++) {
        VECSubtract(&lbl_1_bss_16C[temp_r31], arg0, &spC);
        temp_f31 = VECMag(&spC);
        if (temp_f31 < temp_f30) {
            temp_f30 = temp_f31;
            *arg1 = lbl_1_bss_16C[temp_r31];
        }
    }
    return 1;
}
